// Синхронный и асинхронный код в JavaScript

/* Рассмотрим следующий код:

console.log('1');
console.log('2');

Очевидно, что сначала сработает первый вывод в консоль, а потом - второй. To есть команды нашего кода выполняются по очереди - в порядке их следования в коде. Такой код называется синхронным.

Рассмотрим теперь следующий код:

setTimeout(function() {
    console.log('1');
}, 3000);

console.log('2');

В данном случае команды не выполняются в порядке следования в коде: первый вывод в консоль выполнится, когда приходит его время, но остальной код не ожидает этого момента, а продолжает выполнятся. Такой код называется асинхронным.

Асинхронный код возникает в JavaScript достаточно часто: при работе с таймерами, при привязке обработчиков событий, при загрузке картинок, при работе с технологией AJAX, позволяющей загружать части страницы с сервера, при работе с NodeJS, представляющим собой серверный JavaScript. */

// Асинхронность событийной модели в JavaScript

/* Вы знаете, что с помощью метода addEventListener можно подписаться на различные события, возникающие в элементах страницы. К примеру, подпишемся на клик по некоторому элементу, ссылка на который хранится в переменной elem:

elem.addEventListener('click', function() {
    console.log('1');
});

console.log('2');

В приведенном коде сначала выполнится второй вывод в консоль. Когда же выполнится первый? Когда-то: выполнение этого кода ожидает случившегося события - клика на элемент. Как только это произойдет, так наш код и выполнится. */

/* Расскажите, в каком порядке выведутся числа в консоль:

elem1.addEventListener('click', function() {
	console.log('1');
});
elem2.addEventListener('click', function() {
	console.log('2');
});

Числа выведутся в консоль в зависимости от того, на какой элемент нажмут первым, а на какой вторым. */

// Асинхронность загрузки картинок в JavaScript

/* Картинки, которые динамически создаются через JavaScript, также загружаются асинхронно. Рассмотрим для примера следующий код:

let image = document.createElement('img');
image.src = 'img.png';
document.body.appendChild(image);

Как вы видите, здесь мы создаем тег img, записываем в его src путь к картинке и размещаем эту картинку в body. Картинка, однако, появится на странице не сразу. Дело в том, что когда мы записали в src путь к картинке - браузер начинает скачивать эту картинку с сайта. Как только картинка будет скачана, только тогда браузер сможет ее показать.

Если картинка достаточно большая, а скорость интернета достаточно маленькая, то пользователь сайта некоторое время сможет "полюбоваться" на пустую картинку - пока она не подгрузится.

На самом деле у тега img существует событие load, которое срабатывает при окончании загрузки картинки:

let image = document.createElement('img');
image.src = 'img.png';

image.addEventListener('load', function() {
    // сработает по загрузке картинки
});

Мы можем использовать это, чтобы разместить картинку на странице, только когда эта картинка будет загружена:

let image = document.createElement('img');
image.src = 'img.png';

image.addEventListener('load', function() {
    document.appendChild(image); // размещаем по загрузке
});

Картинка не обязательно загрузится: может быть такое, что путь к картинке неверный, либо произойдет обрыв интернета, поломка сервера с сайтом или что-то подобное. Говоря другими словами - исключительная ситуация. В этом случае сработает не событие load, а событие error:

let image = document.createElement('img');
image.src = 'img.png';

image.addEventListener('load', function() {
	document.body.appendChild(image);
});
image.addEventListener('error', function() {
	// ошибка загрузки картинки
}); */

/* let btn = document.querySelector('button');

btn.addEventListener('click', function() {
    let image = document.createElement('img');

    image.addEventListener('load', function() {
        document.body.appendChild(image);
    });

    image.addEventListener('error', function() {
        alert('Ошибка при загрузке картинки');
    });

    image.src = 'img.jpg';
}); */

// Исключения в асинхронном коде в JavaScript

/* Исключение, возникшее внутри асинхронного кода, не может быть поймано через try-catch:

try {
    setTimeout(finction() {
        throw(new Error); // исключение не будет поймано
    }, 3000);
} catch (error) {
    console.log(error);
} */

/* Расскажите, в чем проблема следующего кода:

try {
	elem.addEventListener('click', function() {
		JSON.parse('some string');
	});
} catch() {
	console.log('некорректный json');
}

try-catch ловит только синхронные ошибки. Все, что внутри callback'ов. */